<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <title>Способы записи алгоритма и структурное программирование на C#</title>
  <link rel="stylesheet" href="./css/index.css">
</head>
<body>

<div class="container">
  <h1>Способы записи алгоритма и структурное программирование на C#</h1>

  <h2>Способы записи алгоритма</h2>
  <p>Алгоритм представляет собой последовательность действий, направленных на решение задачи. Существует несколько способов записи алгоритмов, каждый из которых применяется в зависимости от сложности задачи и предпочтений разработчика:</p>

  <h3>1. Словесно-формульное описание</h3>
  <p><strong>Словесно-формульное описание</strong> — это способ записи алгоритма с помощью текста и математических выражений. Он удобен для объяснения основных шагов алгоритма, но не всегда точен и не подходит для сложных задач.</p>

  <h3>2. Блок-схема</h3>
  <p><strong>Блок-схема</strong> — это графическое представление алгоритма, в котором каждый шаг обозначается блоком (например, прямоугольником для операций, ромбом для условий). Блок-схемы наглядно отображают последовательность шагов и структуру алгоритма, что делает их полезными для визуализации.</p>

  <h3>3. Псевдокод</h3>
  <p><strong>Псевдокод</strong> — это способ описания алгоритма с использованием структур, похожих на синтаксис языков программирования, но без строгих правил. Псевдокод позволяет показать логику алгоритма, оставаясь независимым от конкретного языка.</p>

  <h3>4. Программа на языке программирования</h3>
  <p><strong>Программа на языке программирования</strong> — это непосредственная реализация алгоритма с использованием синтаксиса конкретного языка программирования, такого как Python, C++ или C#. Программа на языке программирования является исполняемым кодом, и её можно запустить для проверки работы алгоритма.</p>

  <h2>Программа на языке высокого уровня в соответствии с методологией структурного программирования (C#)</h2>
  <p><strong>Структурное программирование</strong> — это методология, ориентированная на использование логически упорядоченных блоков кода, которые включают последовательность, ветвление и циклы. Эта методология позволяет строить программы, которые легко читать, понимать и сопровождать.</p>

  <p>Пример программы, написанной на языке C# в соответствии с принципами структурного программирования:</p>

  <h3>Задача:</h3>
  <p>Написать программу для расчёта факториала числа <code>n</code>, введённого пользователем.</p>

  <h3>Программа на C#:</h3>
  <pre>
using System;

class Program
{
    // Метод для вычисления факториала
    static int CalculateFactorial(int n)
    {
        int factorial = 1;
        for (int i = 1; i <= n; i++)
        {
            factorial *= i;
        }
        return factorial;
    }

    // Основной метод
    static void Main()
    {
        Console.Write("Введите число для расчёта факториала: ");
        if (int.TryParse(Console.ReadLine(), out int n))
        {
            if (n >= 0)
            {
                int result = CalculateFactorial(n);
                Console.WriteLine($"Факториал числа {n} равен {result}");
            }
            else
            {
                Console.WriteLine("Факториал определён только для неотрицательных чисел.");
            }
        }
        else
        {
            Console.WriteLine("Пожалуйста, введите корректное целое число.");
        }
    }
}
    </pre>

  <h3>Анализ программы:</h3>
  <p>Программа построена в соответствии с принципами структурного программирования:</p>
  <ul>
    <li><strong>Последовательность:</strong> Код выполняется сверху вниз, последовательно переходя от одной инструкции к другой.</li>
    <li><strong>Модульность:</strong> Программа разделена на метод <code>CalculateFactorial</code> и основной метод <code>Main</code>, каждый из которых выполняет отдельную задачу.</li>
    <li><strong>Ветвление:</strong> Программа использует условия <code>if</code> для проверки ввода пользователя и выполнения нужного кода в зависимости от результата.</li>
    <li><strong>Цикл:</strong> Для вычисления факториала используется цикл <code>for</code>, который последовательно умножает значения.</li>
  </ul>

  <h2>Преимущества структурного программирования</h2>
  <ul>
    <li><strong>Читаемость кода:</strong> Использование функций и структур управления делает программу более понятной.</li>
    <li><strong>Поддерживаемость:</strong> Структурированные программы легче изменять и отлаживать, так как каждый блок кода имеет чёткое назначение.</li>
    <li><strong>Универсальность:</strong> Программы, написанные в стиле структурного программирования, могут быть легко адаптированы для других задач и модифицированы при необходимости.</li>
  </ul>

  <h2>Заключение</h2>
  <p>Для записи алгоритмов используются различные способы, такие как блок-схемы, псевдокод и программы на языках программирования. Методология структурного программирования помогает разрабатывать поддерживаемый и читаемый код за счёт использования функций, последовательности, ветвления и циклов. Эта методология остаётся актуальной и применимой для создания программ на высокоуровневых языках, таких как C#.</p>

</div>

</body>
</html>
